apps/backend/test-setup/tests/performance/load-test.yml
config:
  target: 'http://localhost:3001'
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 10
      name: "Load test"
    - duration: 60
      arrivalRate: 20
      name: "Peak load"
    - duration: 60
      arrivalRate: 5
      name: "Cool down"

scenarios:
  # Public endpoints only - no authentication required
  
  - name: "List Categories"
    weight: 30
    flow:
      - get:
          url: "/api/categories"

  - name: "List Courses"
    weight: 40
    flow:
      - get:
          url: "/api/courses"
          qs:
            limit: 10
            page: 1

  - name: "Get Course Detail"
    weight: 20
    flow:
      # First get list of courses
      - get:
          url: "/api/courses"
          qs:
            limit: 5
          capture:
            - json: "$.data[0].slug"
              as: "courseSlug"
      # Then get detail of first course
      - get:
          url: "/api/courses/{{ courseSlug }}"

  - name: "Browse by Category"
    weight: 10
    flow:
      - get:
          url: "/api/categories"
          capture:
            - json: "$[0].slug"
              as: "categorySlug"
      - get:
          url: "/api/courses"
          qs:
            category: "{{ categorySlug }}"
            limit: 10