apps/backend/test-setup/tests/performance/stress-test.yml
config:
  target: 'http://localhost:3001'
  phases:
    # Ramp up to find breaking point
    - duration: 30
      arrivalRate: 10
      name: "Warm up"
    - duration: 60
      arrivalRate: 30
      name: "Ramp up"
    - duration: 60
      arrivalRate: 60
      name: "High load"
    - duration: 60
      arrivalRate: 100
      name: "Stress level"
    - duration: 30
      arrivalRate: 150
      name: "Breaking point test"
    - duration: 30
      arrivalRate: 10
      name: "Cool down"
  
  # Ensure test completes gracefully
  defaults:
    timeout: 30

scenarios:
  # Public endpoints only - no authentication required
  
  - name: "List Categories"
    weight: 25
    flow:
      - get:
          url: "/api/categories"

  - name: "List Courses"
    weight: 40
    flow:
      - get:
          url: "/api/courses"
          qs:
            limit: 10
            page: 1

  - name: "Get Course Detail"
    weight: 25
    flow:
      - get:
          url: "/api/courses"
          qs:
            limit: 5
          capture:
            - json: "$.data[0].slug"
              as: "courseSlug"
      - get:
          url: "/api/courses/{{ courseSlug }}"

  - name: "Browse by Category"
    weight: 10
    flow:
      - get:
          url: "/api/categories"
          capture:
            - json: "$[0].slug"
              as: "categorySlug"
      - get:
          url: "/api/courses"
          qs:
            category: "{{ categorySlug }}"
            limit: 10